app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Hello World!"], ["created_at", Sun, 17 Aug 2014 16:29:21 UTC +00:00], ["name", "Tommy"], ["updated_at", Sun, 17 Aug 2014 16:29:21 UTC +00:00]]
---
  def create
    Message.create message_params

SELECT `messages`.* FROM `messages`
---
  def index
    @messages = Message.all